In [1]:
from pandas import DataFrame

In [2]:
df = DataFrame({'거래처':['company','company1','company2','company3','company4'],
          '주문량':[5000,12530,6580,27280,12000],
          '할인율':[0.1, 0.5, 0.3, 0.7, 0.2]})
df

        거래처    주문량  할인율
0   company   5000  0.1
1  company1  12530  0.5
2  company2   6580  0.3
3  company3  27280  0.7
4  company4  12000  0.2

In [3]:
df.sum()

거래처    companycompany1company2company3company4
주문량                                      63390
할인율                                        1.8
dtype: object

In [4]:
df.cumsum()

                                       거래처    주문량  할인율
0                                  company   5000  0.1
1                          companycompany1  17530  0.6
2                  companycompany1company2  24110  0.9
3          companycompany1company2company3  51390  1.6
4  companycompany1company2company3company4  63390  1.8

In [5]:
df.mean()

주문량    12678.00
할인율        0.36
dtype: float64

In [6]:
df.describe()

                주문량       할인율
count      5.000000  5.000000
mean   12678.000000  0.360000
std     8801.097659  0.240832
min     5000.000000  0.100000
25%     6580.000000  0.200000
50%    12000.000000  0.300000
75%    12530.000000  0.500000
max    27280.000000  0.700000

In [8]:
df1 = DataFrame({'거래처':['company','company1','company2','company3','company4'],
          '주문량':[5000,10000,6000,2000,12000],
          '할인율':[300, 600, 748, 200, 500]})
df1.sum(axis=1)

0     5300
1    10600
2     6748
3     2200
4    12500
dtype: int64

In [11]:
df2 = DataFrame({'거래처':['company','company1','company2','company3','company4','company2','company3'],
          '주문량':[5000,10000,6000,2000,12000,2400,16000],
          '할인율':[0.1, 0.5, 0.3, 0.7, 0.2, 0.2, 0.6]})
df2

        거래처    주문량  할인율
0   company   5000  0.1
1  company1  10000  0.5
2  company2   6000  0.3
3  company3   2000  0.7
4  company4  12000  0.2
5  company2   2400  0.2
6  company3  16000  0.6

In [12]:
df2.거래처.unique()

array(['company', 'company1', 'company2', 'company3', 'company4'],
      dtype=object)

In [13]:
df2['거래처'].value_counts()

company3    2
company2    2
company4    1
company1    1
company     1
Name: 거래처, dtype: int64